-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Jul 21, 2016 at 01:50 AM
-- Server version: 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `shop`
--

-- --------------------------------------------------------

--
-- Table structure for table `address`
--

CREATE TABLE IF NOT EXISTS `address` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `user_id` int(10) NOT NULL,
  `ostan` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `shahr` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE IF NOT EXISTS `category` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `name` varchar(200) COLLATE utf8_persian_ci NOT NULL,
  `ename` varchar(200) COLLATE utf8_persian_ci NOT NULL,
  `parent_id` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=12 ;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`id`, `name`, `ename`, `parent_id`) VALUES
(8, 'آموزش اندروید', 'android', 0),
(9, 'آموزش php', 'php', 0),
(10, 'آموزش لاراول', 'laravel', 9),
(11, 'آموزشhtml', 'html', 0);

-- --------------------------------------------------------

--
-- Table structure for table `cat_product`
--

CREATE TABLE IF NOT EXISTS `cat_product` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `product_id` int(255) NOT NULL,
  `cat_id` int(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=40 ;

--
-- Dumping data for table `cat_product`
--

INSERT INTO `cat_product` (`id`, `product_id`, `cat_id`) VALUES
(20, 7, 9),
(21, 7, 10),
(33, 8, 8),
(34, 5, 8),
(35, 5, 9),
(38, 9, 9),
(39, 9, 10);

-- --------------------------------------------------------

--
-- Table structure for table `comment`
--

CREATE TABLE IF NOT EXISTS `comment` (
  `id` int(225) NOT NULL AUTO_INCREMENT,
  `name` varchar(200) COLLATE utf8_persian_ci NOT NULL,
  `email` varchar(200) COLLATE utf8_persian_ci NOT NULL,
  `comment` text COLLATE utf8_persian_ci NOT NULL,
  `product_id` int(225) NOT NULL,
  `state` int(1) NOT NULL,
  `time` int(10) NOT NULL,
  `parent_id` int(225) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=281 ;

--
-- Dumping data for table `comment`
--

INSERT INTO `comment` (`id`, `name`, `email`, `comment`, `product_id`, `state`, `time`, `parent_id`) VALUES
(13, 'حسن', 'tecboomb@gmail.com', 'سلام استاد\r\nممنونم از آموزش های خوبتون واقعا این آموزش عالی هستش ممنونم اگه قیمت هارو مناسب قرار بدین که ما که دانشجو هستیم خیلی بهمون فشار نیاد در ضمن همه ما دانشجوها میدونیم که این آموزش خیلی با ارزش تر از این قیمت هاست ولی چکار کنیم ماهم دانشجو هستین و باید استاد هایی مثل شما مواظب ما باشند ممنونم برای این آموزش های خوبتون\r\nراستی استاد قسمت های ششم تا دهم دانلود نمیشن ممنون میشم بررسی کنید.', 5, 1, 1459775134, 0),
(14, 'حسن', 'tecboomb@gmail.com', 'سلام دیگر\r\nببخشید استاد این آموزش از خود قالب طراحی میکنید یا از قبل قالب رو طراحی کردین و فقط سایت رو کامل میکنید', 5, 1, 1459776162, 13),
(15, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nحتما به دانشجو ها تخفیف هایی ارایه میشه که راحت بتونن آموزش ها رو تهیه کنن\r\nالان مشکلی برای دانلود فایل های دمو وجود نداره\r\nضمنا در این دوره فقط قسمت های مهم قالب مانند قسمت منو -اسلایدر و... در دوره ساخته شده و مابقی بخش های قالب که کد های html ساده هستن در طول دوره ساخته نشده', 5, 1, 1459788091, 13),
(16, 'مصطفی ', 'moji.ahmadi87@yahoo.com', 'سلام \r\nدر این آموزش ها از php 7 استفاده شده  ', 5, 1, 1459799504, 0),
(17, 'احسان کاوسی', 'samen.k65@gmail.com', 'باسلام ازشما .ببخشید اگه امکان داره نحوه ی اعمال کوپن تخفیف یا همون کد تخفیف رو هم تو اموزشتون اضافه کنید .ممنون تشکر', 5, 1, 1459799889, 0),
(18, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nنه استفاده نشده', 5, 1, 1459825274, 16),
(19, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nاین مورد هم در دوره گفته شده سرفصل 31 دوره در این زمینه هستش\r\n31- امکان ایجاد بن تخفیف و کارت هدیه برای خرید', 5, 1, 1459825383, 17),
(20, 'مهران', 'nitro2012@ymail.com', 'سلام استاد .. اموزشای سایت قبلی رو تو این سایت هم قرار میدین؟', 5, 1, 1459834695, 0),
(21, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\n\r\nبله آموزش های قبلی هم به این سایت انتقال داده میشه', 5, 1, 1459835018, 20),
(22, 'احسان کاوسی', 'samen.k65@gmail.com', 'سلام مهندس اگه میشه درمورد نرمال سازی دیتابیس وبهینه کردن اونهم برای ساخت جداول پایگاه داده سایت درصورت امکان توضیحاتی بدید.ممنون', 5, 1, 1459841657, 0),
(23, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nچشم حتما', 5, 1, 1459842687, 22),
(24, 'حسن', 'tecboomb@gmail.com', 'سلام استاد\r\nاستاد ببخشید میشه یک دمو از کاری که تا حالا انجام شده قرار بدین ببینیم که دمو سایت چطور هستش ممنون میشم اگه قرار بدین \r\nدمو خیلی میتونه مفید باشه ممنون میشم قرار دهید.', 5, 1, 1459867546, 0),
(25, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\nچون هنوز دوره تموم نشده برای همین میخواستم بعد از اتمام دوره دموی نهایی رو بزارم  ولی بازم چشم دموی کار تا قسمت 101 رو قرار میدم البته دیگه اخرهای دوره هست و تا حداکثر یک هفته دیگه هم تموم میشه و از اتمام قسمت های فروشگاه تصویر قرار میدم', 5, 1, 1459868603, 24),
(26, 'عزت', 'ezatsharif2@gmail.com', 'سلام استاد صدیقی ممنون از دوره خوبتون میشه یه دمو تا قسمت 100 قرار بدید امشب یه نگاه بیاندازیم . تشکر', 5, 1, 1459873490, 0),
(27, 'محمد رضا', 'mrtza.ebrahimnejad@gmail.com', 'لطفا اطلاعات مربوط به دیگر قسمت هارو هم مثل این 33 قسمت بزارید که چه کار هایی کردین در هر قسمت\r\nاین طوری راحتر پیدا میکنیم و دقیقا میدونیم چی خرید کردیم\r\nسایت جدیدرو  هم تبریک میگم\r\nو امکان اضافه سایت  رو هم تو قسمت نظرات اعمال کنید', 5, 1, 1459873533, 0),
(28, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون\r\nاین 33 مورد که نوشته شده سرفصل های کلی دوره هست که هر کدوم از موارد نوشته شده در چندین جلسه از دوره گفته شده\r\nیک فایل راهنمای دوره هم آماده میکنم که مشخص بشه در هر جلسه چه کاری انجام شده', 5, 1, 1459876226, 27),
(29, 'amin', 'amin66.karimi@gmail.com', 'با سلام و خسته نباشید ، اول تشکر بابت آموزش های عالیتون ،،، خیلی عالی و ارزشمنده ممنونم\r\nدوم لطفا حتما فایل راهنمای جلسه به جلسه رو قرار بدید که در هر جلسه چه کاری انجام شده\r\nسوم لطفا برای هر جلسه جداگانه فایل ها قرار داده بشه و در آخر تخفیف مهندس قیمت واسه ما بالاست\r\nمرسی', 5, 1, 1459949697, 0),
(30, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nچشم همه موارد گفته شده انجام میشه', 5, 1, 1459955380, 29),
(31, 'amin', 'amin66.karimi@gmail.com', 'استاد گرون شد که؟؟؟؟؟؟ تا دیروز 80 امروز 90؟؟؟', 5, 1, 1460031629, 29),
(32, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'من توی قسمت نکات قابل توجه هم نوشتم که هزینه  پیش فروش  دوره 80 هزار تومن هست یعنی اگر برای مثال شما با هزینه 80 هزار تومن خرید می کردین می تونستین فایل هایی که تا الان ضبط شده رو دریافت کنید و مابقی فایل ها هم بعد ضبط بهتون داده میشه\nولی هزینه کل دوره حدود 150 هزار تومن خواهد شد البته بعد از اتمام دوره', 5, 1, 1460032110, 29),
(33, 'عزت', 'ezatsharif2@gmail.com', 'سلام استاد ... ببخشید کلا دوره دقیق تا کی تموم میشه و چند قسمت خواهد بود و قیمت نهاییش هم چقدر هستش؟ تشکر', 5, 1, 1460127353, 0),
(34, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\nحداکثر 5 روز دیگه دوره تموم میشه \nهزینه نهایی هم 150 هزار تومان خواهد بود\nتعداد قسمت ها دقیق مشخص نیست ولی در حدود 150 قسمت خواهد بود', 5, 1, 1460129045, 33),
(36, 'e', 'ehsan.monjezi90@yahoo.com', 'استاد از فریم ورک خاصی هم استفاده کردید؟', 5, 1, 1460197456, 0),
(37, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nنه با php خام نوشته شده', 5, 1, 1460198111, 36),
(38, 'عزت', 'ezatsharif2@gmail.com', 'سلام استاد ببخشید توی این دوره تمام قسمت های سایت دیجی کالا به طور کامل مثل صفحه جزییات هر محصول ... سیستم پیجینگ ... جستجوی پیشرفته ... فیلتر ها و ... کامل آموزش داده شده است ؟', 5, 1, 1460268862, 0),
(39, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nبله همه قسمت هایی که گفتین آموزش داده شده', 5, 1, 1460277273, 38),
(41, 'رایموند دراگون', 'Raymond.Dragon@outlook.com', 'درود....خوبی...\nمن آموزش لاراول سایت شما خریدم...\nیه سئوال دارم با این نسخه پی اچ پی 5.6 هست و حالا نسخه 7 آمده چه زمانی باید از نسخه 7 استفاده کنیم؟ \nآیا نسخه هفت کامله و چه امکاناتی نسبت به نسخه 5.6 داره؟\nدر ضمن سایت جدیدت مبارک که با لاراول بالا اوردید متاسفانه وردپرس توی اکثرا هاست اشتراکی سازگاری نداره و منابع زیادی مصرف می کنه...\nوردپرس برای تازه کاران وبلاگ خوبه...\nو لاراول برای حرفه ای هاست...\nموفق باشید...', 5, 1, 1460313189, 0),
(42, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون\r\nدر حال حاظر نسخه پی اچ پی  خیلی از سرور های ایرانی حتی پایین تر از 5.6 هست یعنی شما نمی تونید توی خیلی از هاست ها برای مثال لاراول رو نصب کنید برای همین فکر میکنم خیلی زمانبر هست که سرور ها نسخه 7 پی اچ پی  رو , پشتیبانی کنن\r\nضمنا در نسخه 7 هم علاوه بر اضافه شدن توابع و عملگر های جدید سرعت اجرای کد ها هم خیلی افزایش یافته', 5, 1, 1460316087, 41),
(44, 'azarbod', 'azarbod08@gmail.com', 'سلام آقو\r\nتبریک میگمو ای سایت جدیدتون رو\r\nمیشه یه تخفیف درست و حسابی برا ای دوره بذارین، ما دانشجو هستیمو، پولمون به ای مبالغی که گذاشتینو، نمیرسه\r\nآقو ما منتظریمو', 5, 1, 1460351578, 0),
(45, 'منصور', 'mansout97@yahoo.com', 'سلام استاد صدیقی خسته نباسید می خواستم بگم که حتما امکان پشتیبان گیری و بازیابی بانک اطلاعاتی رو از قسمت مدیریت برای پروژه اضافه کنید ... تشکر', 5, 1, 1460352865, 0),
(47, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nچند روز دیگه تخفیف هم توی سایت قرار داده میشه', 5, 1, 1460353157, 44),
(48, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nچشم حتما این مورد رو هم اضافه میکنم', 5, 1, 1460353219, 45),
(49, 'e', 'ehsan.monjezi90@yahoo.com', 'سلام\r\nقسمت بازاریابی و همکاری در فروش هم پیاده سازی شده؟', 5, 1, 1460357927, 0),
(50, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nبله  ولی در قالب دوره جداگانه منتشر میشه ', 5, 1, 1460359314, 49),
(51, 'محسن', 'mohsensa@gmail.com', 'سلام استاد ببخشید میشه چند عکس دیگه از قسمت اصلی و جزییات و قسمت مدیریت قرار بدید تشکر', 5, 1, 1460362838, 0),
(52, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nتصاویر کامل رو تا فردا شب قرار میدم', 5, 1, 1460364010, 51),
(53, 'حسن', 'hasang@yahoo.com', 'سلام استاد ببخشید یه سوال داشتم آیا 20 قسمت دیگه رو هم کامل آپلود کردید اگه الان یکی این دوره رو خریداری کنه لینک 120 قسمت رو می تونه دریافت کنه ... ممنون', 5, 1, 1460447292, 0),
(54, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nبله الان 120 قسمت از دوره قابل دانلود هست', 5, 1, 1460449012, 53),
(58, 'حسن', 'tecboomb@gmail.com', 'سلام استاد خسته نباشید برای آموزش های خوبتون \nاستاد این عکس هایی که برای دمو قرار دادین مفید نیستن ممنون میشم اگه بتونید یک فیلم چند دقیقه ای از کل امکانات سایت قرار بدین تا کامل خریدار رو جذب کنه ممنون میشم که یک فیلم باشه ...\nتشکر', 5, 1, 1460529251, 0),
(59, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nچشم حتما \r\nفقط چون دوره هنوز تموم نشده برای همین فعلا نمیشه که تصاویر بیشتر یا فیلم از امکانات فروشگاه تهیه کرد بعد از اتمام دوره حتما این کار رو انجام میدم', 5, 1, 1460531232, 58),
(60, 'حسن', 'tecboomb@gmail.com', 'سلام استاد ، خب استاد دوره کی تموم میشه >>> حداقل تا حالا که تموم شده عکس های مربوط به این بخش رو قرار بدین چون این دو عکس که قرار دارین مبهم هستش عکس از محصولات یا قسمت بیشتر یا بخش مدیریت که خیلی مهم هستش ممنون میشم اگه عکس های مربوط به این بخش ها رو قرار بدین تا دوره تموم میشه ما یه دیدی نسبت به سایت داشته باشیم ، تا قسمت 120 این مورد ها تموم شده دیگه، اگه قرار بدین ممنون میشم', 5, 1, 1460535102, 58),
(61, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'چشم عکس از قسمت هایی که تا الان ساخته شده رو قرار میدم', 5, 1, 1460535506, 58),
(71, 'مهدی', 'hamidjabarpoor66@gmail.com', 'با سلام\r\nمن دوره رو خریداری نمودم ولی لینک های دانلود برای من فرستاده نشدند لطفا رسیدگی نمایید', 5, 1, 1460831899, 0),
(73, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\n\r\nلینکا براتون ایمیل شد', 5, 1, 1460840614, 71),
(74, 'hamed', 'hamed_it67@yahoo.com', 'سلام مهندس\nخسته نباشی\nدوره تموم شده؟\nالان کامل هستش؟', 5, 1, 1460958371, 0),
(75, 'azarbod', 'azarbod08@gmail.com', 'جناب صدیقی \r\nپ چرا تخفیف نمیذارین؟\r\nروز پدر نزدیکه ', 5, 1, 1460961402, 71),
(76, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون\r\nنه دوره هنوز در حال ضبط هست', 5, 1, 1460962435, 74),
(78, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nبله تخفیف بابت این مناسبت حتما گذاشته میشه', 5, 1, 1460966639, 71),
(79, 'سعید', 's4rft@yahoo.com', 'سلام استاد\nتبریک بابت سایت جدید\nامروز قیمت 80 تومن بود که شد 100 تومن از شانس من\n:(\nاستاد من قبلا دوره فریم ورک لاراول رو خریداری کرده ام\nحالا میخواستم بپرسم اگه این آموزش رو بخرم تخفیف بیشتری شامل حالم میشه یا نه؟\nتشکر', 5, 1, 1461019158, 0),
(80, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون\r\nبله تخفیف بیشتری بابت خرید های قبلیتون به شما ارایه میشه هر موقع خواستین تهیه کنید بگین کد تخفیف رو براتون ارسال کنم', 5, 1, 1461048394, 79),
(83, 'Mehran', 'softpedia.tec@gmail.com', 'سلام مهندس لطفا بخش چت هم برای این سایت جدید قراربدین ..ممنون', 6, 1, 1461162345, 0),
(84, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nچشم این بخش هم اضافه خواهد شد', 6, 1, 1461186728, 83),
(88, 'سعید', 's4rft@yahoo.com', 'سلام\nممنون استاد\nروز مرد رو هم تبریک میگم\nبنده تا چند روز آینده قصد دارم این آموزش رو بگیرم \nقبلا هم فریم ورک لاراول رو گرفتم حالا میخواستم بدونم قیمت نهایی با تخفیف و با توجه به روز مرد چقدر میشه؟\nتشکر', 5, 1, 1461235496, 0),
(90, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\nممنون\nبا توجه به خرید های قبلی شما 50 درصد تخفیف بهتون داده میشه هر موقع خواستین تهیه کنید اطلاع بدین تا کد تخفیف ارسال بشه', 5, 1, 1461308230, 88),
(100, 'ali', 'ali.soleimani94@yahoo.com', 'سلام استاد\nخدا قوت\nیه سوال داشتم ضبط و آپلود دوره تکمیل شده یا نه؟\nباآرزوی موفقیت ', 5, 1, 1461754167, 0),
(101, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون\r\nبله ضبط دوره تموم شده و حدود 90 درصد دوره هم آپلود  شده و مابقی هم الان در حال آپلود هست', 5, 1, 1461755457, 100),
(102, 'امین کریمی', 'amin66.karimi@gmail.com', 'یه خسته نباشید جانانه ، آموزش این دوره هم مثل دوره های قبلی تون عالیه\nبسیار سپاسگزارم', 5, 1, 1461829739, 0),
(104, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون لطف دارین', 5, 1, 1461839720, 102),
(108, 'علی', 'aliac9488@gmail.com', 'سلام،لطفا نحوه زمان بندی کردن کوپن و هدیه رو هم بگین!!!\r\n\r\n', 5, 1, 1462018061, 0),
(110, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nاین مورد در دوره توضیح داده شده', 5, 1, 1462027588, 108),
(112, 'مهدی', 'hamidjabarpoor66@gmail.com', 'سلام\nلطفا یه بخش کاربران هم اضافه کنید و نحوه ی بستن اکانت کاربران رو هم بگید\nممنون', 5, 1, 1462035064, 0),
(114, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nببخشید با توجه به اتمام دوره دیگه نمیشه بخش هایی رو به دوره اضافه کرد البته در فروشگاه ایجاد شده مشابه سایت دیجی کالا امکان ثبت نام و پنل کاربری وجود داره', 5, 1, 1462041772, 112),
(115, 'محمد', 'mohammad_r_7293@yahoo.com', 'سلام استاد\nاستاد میخواستم بدونم سورس این پروژه و دیتابیس و کلیه فایلاش هم توی این آموزش موجود هست یا اینکه فیلما رو باید ببینیم و خودمون کد بزنیم ؟', 5, 1, 1462049032, 0),
(117, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\nبله سورس کامل دوره به همراه فایل sql همراه فیلم های دوره قرار داده شده', 5, 1, 1462049997, 115),
(120, 'رضا صفدری', 'rezasafdari52@yahoo.com', 'سلام بر استاد گرام\nده تا فیلم دمو رو دیدم خیلی باحال بود\nدلم میخواد بقیه اش رو هم ببینم\nفقط یه سوال داشتم و اونم این هست که حجم دوره چقدر هستش \nمن چون دارم  ای دی اس الم رو عوض میکنم و میخوام از یه شرکت دیگه بگیرم یعنی تا آخر هفته فقط فرصت دارم برای دانلود،و کلی از حجم اینترنتم مونده، آیا میشه تا آخر همین هفته همه قسمت های دوره رو دانلود کرد یا نه؟\n', 5, 1, 1462180547, 0),
(121, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\nحجم دوره حدود 7 گیگ هست که راحت می تونید تا اخر هفته همش رو دانلود کنید', 5, 1, 1462181404, 120),
(124, 'محمدرضا', 'joveini224@yahoo.com', 'سلام\r\n\r\nآیا قالب ریسپانسیوه؟\r\n', 5, 1, 1462287087, 0),
(125, 'مدیر-صدیقی', 'ali@yahoo.com', 'سلام\r\nنه قالب سایت ریسپانسیو نیست', 5, 1, 1462289852, 124),
(127, 'نعیمی', 'naeime.np@gmail.com', 'سلام خسته نباشید من نمیتونم تو نظرات سایتمو وارد کنم مشکلی داره سایتتون.اگه ممکنه این قسمت رو هم بزارید', 5, 1, 1462349953, 0),
(128, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\nممنون\nبله به بخش نظرات قسمت وارد کردن سایت رو من اضافه نکردم و فقط نام-ایمیل و نظر رو می تونید ثبت کنید', 5, 1, 1462353324, 127),
(131, 'مهدی اسلامی', 'p30lod@gmail.com', 'سلام استاد من دانشجوی رشته نرم افزار هستم و  میخوام این دوره رو بخرم ولی توانم نیست ک صد و پنجاه هزار تومان پرداخت منم! \nلطفا یه بن تخفیف بدید ک بتونم با قیمت پایین تر این اموزش را دریافت کنم متشکرم. ', 5, 1, 1462465393, 0),
(132, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\nکد تخفیف به ایمیلتون ارسال شد ', 5, 1, 1462466200, 131),
(139, 'ali', 'e.chenaran@chmail.ir', 'با سلام \nآپلود تمامی قسمت های دوره تکمیل شده؟ \nبا تشکر', 5, 1, 1462763904, 0),
(140, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nبله', 5, 1, 1462787493, 139),
(144, 'nima rezaee', 'nimanima35@gmail.com', 'سلام این اموزش تمام شده ؟  ', 5, 1, 1462895150, 0),
(145, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nبله تموم شده', 5, 1, 1462896388, 144),
(146, 'Mehran', 'softpedia.tec@gmail.com', 'سلام استاد خسته نباشید .. این اموزش نسخه اندروید برای فروشگاه قبلی همون که با معماری MVC کد نویسی کردین ساخته شده؟\nممنون', 8, 1, 1463029325, 0),
(147, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nبله', 8, 1, 1463036334, 146),
(149, 'علی ', 'aliasgharnasiri72@yahoo.com', 'استاد سلام . با Matretia design  تو این آموزش استفاده میکنید ؟!', 8, 1, 1463036499, 0),
(150, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\n\r\nبله حتما متریال دیزاین هم در این دوره تدریس میشه', 8, 1, 1463037129, 149),
(151, 'milad', 'milad1441mosafaii@yahoo.com', 'تو این آموزش از asynTask  و لیست هایی که اطلاعات رو چند تایی از سرور میگیرن  هم استفاده کنین', 8, 1, 1463037927, 149),
(152, 'hossein', 'h.tadayyon@yahoo.com', 'با سلام و خسته نباشید.قسمت دو دانلود نمیشه', 8, 1, 1463068378, 0),
(153, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nالان می تونید دانلود کنید', 8, 1, 1463072354, 152),
(157, 'nima rezaee', 'nimanima35@gmail.com', 'سلام من دانشجو هستم تخفیف بهم بده تابتونم خرید کنم این هزینه برام خیلی سنگینه واقعا ', 5, 1, 1463392700, 0),
(158, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nلطفا ایمیلتون رو چک کنید', 5, 1, 1463409588, 157),
(165, 'nima rezaee', 'nimanima35@gmail.com', 'سلام تو این اموزش از نرم افزار android studio  استفاده کردین ؟ ', 8, 1, 1463639272, 0),
(166, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nبله ضمنا دو قسمت اول دوره برای آشنایی بیشتر در سایت قرار گرفته', 8, 1, 1463651152, 165),
(176, 'ایمان', 'imansaberi67@gmail.com', 'سلام استاد ببخشید اگر بنده الان این دوره را خریداری کنم می خواستم ببینم بعد از کامل شدن دوره آیا بازهم باید هزینه ای پرداخت کنم یا خیر کل دوره را باهمان مبلغ که پرداخت کردم به بنده می دهید و یک سوال دیگه اگر بنده بخواهم این آموزش +پیاده سازی فروشگاه اینترنتی مشابه دیجی کالا با PHP MVC+پکیج آموزش فریم ورک Yii +بسته حرفه ای آموزش فریم ورک لاراول+دوره آموزش پلاگین نویسی وردپرس+دوره چند قالبه کردن سایت در php که در می آید 786000 تومان را از شما خریداری کنم به صورت پستی با توجه به اینکه دانشجو هستم و این رو هم می دانیم متاسفانه در دانشگاه های ما چیز زیادی رو یاد نمی دهند که بعد در بازار کار به درد ما بخورد می خواستم بدانم چه میزان می توانید به بنده تخفیف بدهید تا کل مجموعه را خریداری کنم.\nبا تشکر از شما به خاطر آموزش های عالی و کاربردی که گذاشته اید.', 8, 1, 1464005355, 0),
(177, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\nبله در صورت تهیه دوره پیاده سازی اپلیکیشن اندروید برای وب سایت تا انتهای دوره شما دیگه هیج مبلغی رو واریز نخواهید کرد و بعد از ضبط هر قسمت لینک بهتون ارسال میشه\nدر مورد تخفیف هم ایمیل ارسال کردم لطفا بررسی کنید', 8, 1, 1464009728, 176),
(179, 'محمد', 'khandadash67@gmail.com', 'سلام . تو سایت پی اچ پی لرن به مناسبت های مختلف کوپن تخفیف قرار می دادید در صورت امکان کد تخفیف برای منم ارسال کنید', 5, 1, 1464029424, 0),
(180, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nلطفا ایمیلتون رو چک کنید', 5, 1, 1464033286, 179),
(185, 'شیما', 'takbox@yahoo.com', 'سلام.از سایت خوبتون تشکر میکنم.یه سوال داشتم همین دوتا آموزش رو در سایت دارید؟میشه یه آموزش برای ساخت سایت خدماتی برای افزایش بازدید بزارید؟آموزشهای بعدی شما کی اماده میشه', 8, 1, 1464250232, 0),
(186, 'maxim', 'maxim@gmail.com', 'سلام\r\nاین اموزش چند قسمت میشه کلا  ؟ ', 8, 1, 1464264458, 0),
(187, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون\r\nاین سایت تازه راه اندازی شده و آموزش های قبلی توی سایت php-learn.ir هست\r\nفعلا دوره اندروید در حال ضبط هست بعد از اون هم دوره  ios منتشر خواهد شد', 8, 1, 1464264881, 185),
(188, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nاحتمالا 80 قسمت بشه البته تا الان 35 قسمت ضبط شده ولی فعلا 10 قسمتش رو آپلود کردم', 8, 1, 1464265053, 186),
(198, 'محمد', 'Mohammad.fp70@gmail.com', 'سلام استاد خسته نباشید \nمن دانشجو ام  امکان داره کد تخفیف و ارسال کنید که بتونم خریداری کنم ?', 8, 1, 1464630136, 0),
(202, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nلطفا ایمیلتون رو چک کنید', 8, 1, 1464716222, 198),
(208, 'علی', 'aliac9488@gmail.com', 'سلام،لطفا در این آموزش  از api بالا استفاده کنید و بیشتر روی رابط کاربری کار کنید و از تکنولوژی های بروز استفاده کنید ممنون', 8, 1, 1465373529, 0),
(211, 'محمد', 'madnasoft@yahoo.com', 'سلام\nببخشید من اموزش لاراول قبلا  خریدم \nاگر میشه تخفیف خوبی برای خرید این محصول بهم بدید ممنون میشم', 5, 1, 1465569290, 0),
(212, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nلطفا ایمیلتون رو چک کنید', 5, 1, 1465572993, 211),
(213, 'محمد', 'madnasoft@yahoo.com', 'سلام . ببخشید من  mvc و شی گرایی(pdo) و نحوه کلاس سازی  اصلا بلد نیستم \nایا با خریدن این اموزش به مشکل بر می خورم؟', 5, 1, 1465589739, 0),
(214, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nmvc کامل در دوره آموزش داده شده و نیازی نیست از قبل بلد باشین\r\nولی در مورد شی گرایی بهتره اول 10 قسمت اول دوره رو مشاهده کنید اگر توی اون 10 قسمت به مشکل برنخورید در ادامه دوره هم مشکلی نخواهید داشت', 5, 1, 1465596738, 213),
(217, 'سعید', 's4rft@yahoo.com', 'سلام استاد وقتتون بخیر\nطاعات و عباداتتون قبول باشه\nاستاد یک درخواست داشتم میشه اخر دوره نحوه ساخت ربات تلگرام اموزش بدید؟\nکه برای مثال ربات به دیتابیس فروشگاه وصل باشه و کابر بعد از خرید کد فاکتورش که برای ربات بفرسته بتونه ببینش خریدش تایید شده یا ارسال شده یا نه\nیا همین قابلیت رو تو اپلیکشن هم پیاده سازی کنید\nممنون', 8, 1, 1465716934, 0),
(219, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\n\nچشم حتما تهیه میشه ولی بهتره در قالب دوره جداگانه آماده بشه', 8, 1, 1465751329, 217),
(222, 'علی', 'd.software@gmail.com', 'سلام \r\nاستاد mvc که اموزش می دید mvc شماره چند است', 5, 1, 1465818124, 0),
(223, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nتوی php  معماری mvc ورژن نداره', 5, 1, 1465825294, 222),
(224, 'غزاله علیزاده', 'ghazal_shahi75@yahoo.com', 'سلام استاد\nببخشید من می خواستم از سایتتون خرید کنم میشه لطف کنید کد تخفیف به من بدید خودتون بهتر می دونید وضعیت دانشجو چطوره لطفا دیگه خودتون کمک کنید پکیج لاراول رو کامل لازم دارم و به نظرتون با این اموزش ها همه چیزو یادم می گیرم ؟ استاد خواهشا فقط تخفیف خوبی بدید بهم واقعا الان از نظر مالی مشکل دارم و اینها برای یاد گیری و بعد بازار کار می خوام لطفا دیگه خودتون کمک کنید.', 8, 1, 1465884770, 0),
(225, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nلطفا ایمیلتون رو چک کنید', 8, 1, 1465895001, 224),
(231, 'سعادتی', 'web1400@gmail.com', 'سلام خسته نباشید \nده دوره رو دانلود کردم تا الان که عالی بود \nفقط اینکه امکان ش هست که  تخفیف هم روی این بسته اعمال کنید ؟\nممنون از زحمات شما ', 5, 1, 1466018566, 0),
(232, 'محمد', 'madnasoft@yahoo.com', 'سلام استاد یه مشکل تو اموزش برخوردم من سرویس\nrewrite_moduleدر wampserver فعال کردم اما هنوز error500 ldnin  مشکل از کجای کارم است؟', 5, 1, 1466023921, 0),
(233, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون لطف دارین \r\nکد تخفیف به ایمیلتون ارسال شد', 5, 1, 1466028595, 231),
(239, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nاحتمالا کد های  فایل  htaccess رو اشتباهی نوشتین\r\nخواستین سورس کدی که نوشتین رو ایمیل کنید من بررسی کنم', 5, 1, 1466088221, 232),
(240, 'محمد', 'madnadoft@yahoo.com', 'چشم سورس در اولین فرصت می فرستم', 5, 1, 1466099973, 232),
(242, 'محمد', 'madnadoft@yahoo.com', 'الحمدالله مشکل حل شد', 5, 1, 1466116270, 232),
(246, 'محمد', 'madnasoft@yahoo.com', 'سلام استاد \nقبلا به شما پیام دادم که من اموزش لاراول از شما خرید کردم  و در خواست تخفیف کردم و شما گفتید زمان خریدن خبرتون کنم کد تخفیف بدهید ممنون میشم تخفیف خوبی بدهید \nمنتظر کد هستم', 5, 1, 1466251125, 0),
(247, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nکد تخفیف به ایمیلتون ارسال شد', 5, 1, 1466253005, 246),
(249, 'جواد محمدی', 'saman.mcu@gmail.com', 'سلام استاد !\nده قسمت دمو رو دیدم و بسیار راضی بودم.حالا می خوام کل دوره را خریداری کنم  ولی دانشجو هستم و با این خرج و  گرونی کمی برام مشکله این هزینه رو پرداخت کنم.\nامکانش هست که بهم تخفیف بدید ؟', 5, 1, 1466492744, 0),
(250, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون\r\nکد تخفیف به ایمیلتون ارسال شد', 5, 1, 1466526133, 249),
(254, 'مهدی', 'mhdi20@gmail.com', 'سلام \r\nلطفا کد تخفیف را برای من هم بفرستید\r\nممنون', 5, 1, 1466929136, 0),
(255, 'جزینی', 'sajadjazinizadeh@yahoo.com', 'عرض سلام خدمت شما استاد محترم من از کاربران پی اچ پی لرن هستم میخواستم خواهش کنم اگه امکانش وجود داره تخفیف رمضان سایت رو برای این دوره هم فعال کنید به شدت ب تخفیف نیاز داره خیلی ممنون اگه اطلاع رسانی کنید', 5, 1, 1466951604, 0),
(256, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nلطفا ایمیلتون رو چک کنید', 5, 1, 1466952550, 255),
(258, 'alireza', 'alirezax61@gmail.com', 'سلام استاد . ایا برای این دوره باید جاوا را بلد باشیم ؟ در واقع ایا برنامه نویسی اندروید از پایه اموزش داده میشه یا نه ؟ ضمنا اگه ممکنه نظرتون درباره برنامه نویسی با phonegap را هم بفرمایید . در واقع روشی که بدون استفاده از جاوا بلکه با زبانهای html5 و javascript برای اندروید و ios برنامه مینویسند. ممنون ', 8, 1, 1467281324, 0),
(259, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nنه نیازی نیست قبلا با جاوا کار کرده باشین\r\nضمنا در دو قسمت اول که رایگان منتشر شده در مورد فریم ورک هایی مثل phonegap و زامارین توضیحاتی داده شده', 8, 1, 1467283299, 258),
(262, 'ali', 'aftabgardan721@gmail.com', 'سلام استاد \nاول اینکه تشکر می کنم بابت دوره عالی که آموزش دادین .\nراستش من قصد خرید این دوره رو دارم اگر لطف کنین یه تخفیف دانشجویی هم برای من قرار بدین ، البته مسلما این پکیج ارزش بالایی داره ولی خب راستش الان برای من یکم سنگینه .\nخیلی ممنون', 5, 1, 1467396519, 0),
(264, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nخواهش میکنم\r\nکد تخفیف به ایمیلتون ارسال شد', 5, 1, 1467435695, 262),
(265, 'محمدحسین', 'thesadswan@gmail.com', 'با سلام ببخشید بنده این مجموعه رو میخواستم  اما چند تا سوال داشتم:\nاینکه آیا سورس کامل هم همراه آموزش هست؟\nو اینکه کد تخفیف رو از کجا باید بگیرم؟', 5, 1, 1467465106, 255),
(266, 'نیما رضایی', 'nimanima35@gmail.com', 'سلام اقای صدیقی بنده دانشجو هستم دست و بالم خیلی تنگه هزینه تحصیل دانشگاه رو  هم تابستون  کار میکنم خودم میدم -  برای فردا میخوام این دوره رو بخرم میشه لطف کنید کد تخفیف به ایمیلم بفرستید \nممنون ', 5, 1, 1467651171, 0),
(271, 'مهران بلوچی', 'eagle.horuss4@yahoo.com', 'سلام استاد خسته نباشید من با استفاده از آموزش لاراول یک سایت فروش فالوور اینستاگرام  ساختم در یک صفحه 9 تا فرم برای محصولات درست که اول کاربر مشخصات خودش را داخل فرم وارد کنند واس ذخیره شود برای ثبت بعد قیمت محصول رو محاسبه کنم و کاربر وارد شود به درگاه بانک الان من چطوری این کدنویسی رو انجام بدم طبق آموزش شما هرمحصول یک ای دی دارد طبق اون ای دی قیمتش دریافت می شود ولی اول مشخصات کاربر دریافت شود بعد قیمت محصول محاسبه شود و داخل فرم هرچی ادرس میدم لاراول خطا میده لطفا کمک کنید چطوری ادرس دهی کنم استاد خیلی پروژه ضروری است خواهش میکنم کمکم کنید.\nو پروژه رو به ایمیل تون ارسال کردم ', 8, 1, 1467746819, 0),
(272, 'مدیر-صدیقی', 'ali.sedighi.tu@gmail.com', 'سلام\r\nممنون\r\nفعلا  ایمیلی از طرف شما دریافت نکردم اگر سورس کامل رو ارسال کنید حتما راهنمایی میکنم مشکلتون حل بشه', 8, 1, 1467752842, 271);

-- --------------------------------------------------------

--
-- Table structure for table `discounts`
--

CREATE TABLE IF NOT EXISTS `discounts` (
  `id` int(225) NOT NULL AUTO_INCREMENT,
  `discounts_name` varchar(225) COLLATE utf8_persian_ci NOT NULL,
  `discounts_value` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=7 ;

--
-- Dumping data for table `discounts`
--

INSERT INTO `discounts` (`id`, `discounts_name`, `discounts_value`) VALUES
(6, 'php', 40);

-- --------------------------------------------------------

--
-- Table structure for table `download`
--

CREATE TABLE IF NOT EXISTS `download` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `file` varchar(1000) COLLATE utf8_persian_ci NOT NULL,
  `name` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `time` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=27 ;

--
-- Dumping data for table `download`
--

INSERT INTO `download` (`id`, `file`, `name`, `time`) VALUES
(1, 'file/1.zip', '0d07fa6db09f33b0df05c14f5acdad05', 1468962790),
(2, 'file/2.zip', '0d07fa6db09f33b0df05c14f5acdad05', 1468962790),
(3, 'file/1.zip', 'cd58bdaaa8d4e61e372aa8f2fd88638d', 1468962907),
(4, 'file/2.zip', 'cd58bdaaa8d4e61e372aa8f2fd88638d', 1468962907),
(5, 'file/1.zip', '893e0100fd902cfcc32bc3aa0c4d3d9d', 1468963019),
(6, 'file/2.zip', '893e0100fd902cfcc32bc3aa0c4d3d9d', 1468963019),
(7, 'file/1.zip', 'e6292ce73786dbd4492b437e521ae8ce', 1468963125),
(8, 'file/2.zip', 'e6292ce73786dbd4492b437e521ae8ce', 1468963125),
(9, 'file/1.zip', '9be7d718686adbdb2211eeee3a209c60', 1468963140),
(10, 'file/2.zip', '9be7d718686adbdb2211eeee3a209c60', 1468963140),
(11, 'file/1.zip', '64413c7ecbe501a4d2e7ee6b7ab2fb11', 1468963152),
(12, 'file/2.zip', '64413c7ecbe501a4d2e7ee6b7ab2fb11', 1468963152),
(13, 'file/1.zip', '095f24294bc54239f0f813541b36a67b', 1468963269),
(14, 'file/2.zip', '095f24294bc54239f0f813541b36a67b', 1468963269),
(15, 'file/1.zip', '797820937ce1de9df56b7c293f9887ec', 1468971673),
(16, 'file/2.zip', '797820937ce1de9df56b7c293f9887ec', 1468971673),
(17, 'file/1.zip', '117215203868250c99fcab2d2eb523db', 1468971758),
(18, 'file/2.zip', '117215203868250c99fcab2d2eb523db', 1468971758),
(19, 'file/1.zip', 'c453a9f0cdc6b155286c43417e1b763b', 1468971780),
(20, 'file/2.zip', 'c453a9f0cdc6b155286c43417e1b763b', 1468971780),
(21, 'file/1.zip', 'be2947590905d1f1d45625659517a0b6', 1468971853),
(22, 'file/2.zip', 'be2947590905d1f1d45625659517a0b6', 1468971853),
(23, 'file/1.zip', '519b13af427c1a2fe58ea98a4a9e9f2b', 1468971883),
(24, 'file/2.zip', '519b13af427c1a2fe58ea98a4a9e9f2b', 1468971883),
(25, 'file/1.zip', 'e634aa00928021c97d53cbe135625965', 1468971911),
(26, 'file/2.zip', 'e634aa00928021c97d53cbe135625965', 1468971911);

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE IF NOT EXISTS `migrations` (
  `migration` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`migration`, `batch`) VALUES
('2014_10_12_000000_create_users_table', 1),
('2014_10_12_100000_create_password_resets_table', 1),
('2016_07_20_222732_create_session_table', 2),
('2016_07_20_223859_create_test_table', 2);

-- --------------------------------------------------------

--
-- Table structure for table `order`
--

CREATE TABLE IF NOT EXISTS `order` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `fname` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `lname` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `mobile` varchar(200) COLLATE utf8_persian_ci NOT NULL,
  `time` int(10) NOT NULL,
  `date` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `product_id` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `payment_status` varchar(20) COLLATE utf8_persian_ci NOT NULL,
  `RefId` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `saleReferenceId` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `zip_code` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `address` text COLLATE utf8_persian_ci NOT NULL,
  `order_read` varchar(20) COLLATE utf8_persian_ci NOT NULL,
  `total_price` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `price` int(100) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=14 ;

--
-- Dumping data for table `order`
--

INSERT INTO `order` (`id`, `fname`, `lname`, `email`, `mobile`, `time`, `date`, `product_id`, `payment_status`, `RefId`, `saleReferenceId`, `zip_code`, `address`, `order_read`, `total_price`, `price`) VALUES
(2, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-22', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(3, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-22', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(4, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-23', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(5, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-24', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(6, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-24', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 25000),
(7, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-25', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(8, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-26', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(9, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-27', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(10, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-27', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(11, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-28', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(12, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-29', '5,8,', 'معلق', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '1500000', 15000),
(13, 'علی', 'صدیقی', 'ali.sedighi.tu@gmail.com', '09141592093', 1468799160, '1395-4-29', '5,8,', 'پرداخت شده', '0318C1D5A29AEB7A', '', '1234567891', 'تبریز', 'ok', '200000', 16000);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE IF NOT EXISTS `password_resets` (
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL,
  KEY `password_resets_email_index` (`email`),
  KEY `password_resets_token_index` (`token`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `password_resets`
--

INSERT INTO `password_resets` (`email`, `token`, `created_at`) VALUES
('araz@gmail.com', '1a23dad8251c3862a3fb62f8c5df94e5455a88ff191bd1de0e3dd28dc6caa34b', '2016-07-16 16:43:14'),
('ali.sedighi.tu@gmail.com', '07faa056491dfe122679cf8fef7478ead74b4250eb533acbbf94f5fd98c703fd', '2016-07-16 17:00:25');

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

CREATE TABLE IF NOT EXISTS `product` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `title` varchar(300) COLLATE utf8_persian_ci NOT NULL,
  `url` varchar(1000) COLLATE utf8_persian_ci NOT NULL,
  `content` text COLLATE utf8_persian_ci NOT NULL,
  `date` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `img` varchar(1000) COLLATE utf8_persian_ci NOT NULL,
  `price` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `order_number` int(10) NOT NULL,
  `download` text COLLATE utf8_persian_ci NOT NULL,
  `files_size` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `files_time` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `number_files` int(225) NOT NULL,
  `tag` text COLLATE utf8_persian_ci NOT NULL,
  `View` int(225) NOT NULL,
  `state` int(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=10 ;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`id`, `title`, `url`, `content`, `date`, `img`, `price`, `order_number`, `download`, `files_size`, `files_time`, `number_files`, `tag`, `View`, `state`) VALUES
(5, 'پیاده سازی فروشگاه اینترنتی مشابه دیجی کالا با PHP MVC', 'پیاده-سازی-فروشگاه-اینترنتی-مشابه-دیجی-کالا-با-PHP-MVC', '<p>به نام خدا</p>\r\n\r\n<p>با عرض سلام و ادب خدمت کاربران <span style="color:#FF0000">سایت ایده پردازان جوان</span></p>\r\n\r\n<p>معماری <span style="color:#FF0000">mvc</span> و ساخت پروژه های کابردی با این معماری از جمله مواردی هست که کمتر در منابع آموزشی مختلف&nbsp; به آن پرداخته شده لذا بر آن شدیم تا یک دوره کامل برای آموزش این معماری آماده کنیم و علاوه بر آن یک فروشگاه قدرتمند مشابه سایت دیجی کالا با معماری <span style="color:#FF0000">mvc</span> پیاده سازیم نماییم</p>\r\n<!--more-->\r\n\r\n<div class="ck_div1">\r\n<p><span style="color:#FF0000">اهداف دوره آموزشی</span></p>\r\n\r\n<p>آموزش معماری mvc و مزیت استفاده از این معماری در ساخت پروژه ها</p>\r\n\r\n<p>آموزش نحوه به کارگیری شی گرایی در جهت سهولت در کد نویسی وب سایت و ساخت پروژه های php در کمترین زمان ممکن</p>\r\n\r\n<p>آموزش کار با وبسرویس پرداخت بانک های ملت,صادرات و سامان</p>\r\n\r\n<p>به کار گیری اصول امنیتی در ساخت پروژه های php و جلوگیری از حملات معروف از جمله csrf و..</p>\r\n\r\n<p>پیاده سازی یک فروشگاه کامل مشابه فروشگاه دیجی کالا</p>\r\n</div>\r\n\r\n<div class="ck_div1">\r\n<p><span style="color:#FF0000">سر فصل های دوره آموزشی</span></p>\r\n\r\n<p>1 - آموزش شی گرایی در php و ساخت کلاس های کاربردی برای سهولت در کد نویسی</p>\r\n\r\n<p>2 - آموزش معماری mvc و تنظیم فایل&nbsp;htaccess برای ساخت url های استاندارد</p>\r\n\r\n<p>3 - پیاده سازی کلاس Validation جهت اعتبار سنجی پیشرفته فرم ها</p>\r\n\r\n<p>4 - کنترل درخواست های ارسالی و جلوگیری از حملات csrf</p>\r\n\r\n<p>5 - کار با session در php و ذخیره آن در دیتابیس و ایجاد سطح دسترسی برای کاربران سایت</p>\r\n\r\n<p>6 - آموزش ساخت و مدیریت منوی های چند سطحی در php</p>\r\n\r\n<p>7 - آموزش ساخت و مدیریت بخش اسلایدشو فروشگاه</p>\r\n\r\n<p>8 - ساخت قسمت ایجاد محصول با امکان تعیین رنگ و تصویر نا محدود برای هر محصول</p>\r\n\r\n<p>9 - افزودن امکان تعیین گارانتی برای هر محصول و تعیین هزینه محصول بر اساس گارانتی و رنگ محصول</p>\r\n\r\n<p>10- امکان تعیین هزینه محصول در بازه های زمانی مختلف و نمایش نمودار تغییرات هزینه در صفحه معرفی محصول</p>\r\n\r\n<p>11- ساخت صفحه نماش محصول با امکان زوم بر روی تصاویر محصول(مشابه دیجی کالا)</p>\r\n\r\n<p>12- کار با کتابخانه jscolor جهت انتخاب کد رنگ موقع ثبت محصول</p>\r\n\r\n<p>13- امکان ثبت مشخصات فنی به صورت کاملا داینامیک بر اساس دسته بندی محصول</p>\r\n\r\n<p>14- امکان ثبت مشخصات فنی بری هر محصول</p>\r\n\r\n<p>15- افزودن امکان ثبت نقد و بررسی تخصصی برای هر محصول(مشابه سایت دیجی کالا)</p>\r\n\r\n<p>16- ساخت قسمت فیلترینگ محصولات برای جست و جوی پیشرفته محصول بر اساس تعداد سیم کارت -رنگ و... به صورت کاملا داینامیک</p>\r\n\r\n<p>17- نمایش محصول براساس ویژگی هایی مانند رده سنی - نوع سیستم عامل و ....</p>\r\n\r\n<p>18- امکان امتیاز دهی به محصولات بر اساس کیفیت - کارایی و...</p>\r\n\r\n<p>19- امکان ثبت نظر توسط کاربران سایت و مشخص کردن نقاط قوت و ضغف محصول(مشابه دیجی کالا)</p>\r\n\r\n<p>20- امکان ثبت پرسش برای هر محصول و لایک و دیس لایک پرسش های ارسال کاربران</p>\r\n\r\n<p>21- پیاده سازی سبد خرید محصولات</p>\r\n\r\n<p>22- افزودن محصول به سبد خرید بر اساس رنگ و نوع گارانتی</p>\r\n\r\n<p>23- امکان تعیین شیوه پرداخت (واریز آنلاین-کارت به کارت-واریز به حساب ) توسط خریدار</p>\r\n\r\n<p>24- امکان واریز وجه از طریق درگاه پرداخت بانک های ملت-صادرات-سامان</p>\r\n\r\n<p>25- آموزش ارسال sms در php و ارسال sms موقع ثبت خرید</p>\r\n\r\n<p>26- امکان مدیریت سفارشات و تعین وضعیت سفارش(معلق-پرداخت شده-در حال آماده سازی-ارسال شده)</p>\r\n\r\n<p>27- تعیین میزان فروش سایت&nbsp; برا اساس روز-ماه-هفته-سال</p>\r\n\r\n<p>28- نمایش میزان درآمده و تعداد فروش 30 روز گذشته سایت در قالب نمودار</p>\r\n\r\n<p>29- ایجاد خبرنامه و آموزش کار با ایمیل در php</p>\r\n\r\n<p>30-ساخت پنل کاربری و نمایش لیست خرید های کاربر-ادرس های ثبت شده و...</p>\r\n\r\n<p>31- امکان ایجاد بن تخفیف و کارت هدیه برای خرید</p>\r\n\r\n<p>32- ساخت فایل نصب برای فروشگاه اینترنتی</p>\r\n\r\n<p>33- و....</p>\r\n</div>\r\n\r\n<div class="ck_div1">\r\n<p><span style="color:#FF0000">10 قسمت اول دوره جهت تست و ارزشیابی</span></p>\r\n\r\n<p>توجه : برای مشاهده فیلم های دوره حتما از نرم افزار&nbsp;<span style="color:#FF0000">VLC media player</span> استفاده شود</p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/1.zip"><span style="color:#000000">دانلود قسمت اول دوره</span></a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/2.zip"><span style="color:#000000">دانلود قسمت دوم دوره</span></a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/3.zip"><span style="color:#000000">دانلود قسمت سوم دوره</span></a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/4.zip"><span style="color:#000000">دانلود قسمت چهارم دوره</span></a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/5.zip"><span style="color:#000000">دانلود قسمت&nbsp;پنجم دوره</span></a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/6.zip"><span style="color:#000000">دانلود قسمت ششم دوره</span></a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/7.zip"><span style="color:#000000">دانلود قسمت هفتم دوره</span></a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/8.zip"><span style="color:#000000">دانلود قسمت هشتم دوره</span></a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/9.zip"><span style="color:#000000">دانلود قسمت نهم دوره</span></a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/demo/10.zip"><span style="color:#000000">دانلود قسمت دهم دوره</span></a></p>\r\n</div>\r\n', '1468095349', '1468531583.jpg', '1500000', 5, 'file/1.zip', '8.2 گیگابایت', '65 ساعت', 200, 'آموزش,ساخت فروشگاه اینترنتی,فروشگاه,آموزش php,آموزش ajax,ساخت وب سایت با php', 1, 3),
(8, 'پیاده سازی اپلیکیشن اندروید برای وب سایت', 'پیاده-سازی-اپلیکیشن-اندروید-برای-وب-سایت', '<p>به نام خدا</p>\r\n\r\n<p>با عرض سلام و ادب خدمت کاربران <span style="color:#FF0000">سایت ایده پردازان جوان</span></p>\r\n\r\n<p>یکی از راه های موثر برای افزایش ارتباط وب سایت با کاربرانش ساخت نسخه های موبایل برای وب سایت می باشد و البته ساخت نسخه اندروید وب سایت به دلیل فراگیر بودن این سیستم عامل از اهمیت بالایی برخوردار هست از همین جهت در این دوره سعی شده ساخت اپلیکیشن اندروید برای یک وب سایت به صورت کامل و با تمام جزییات آموزش داده شود تا بعد از مشاهده این دوره مخاطبان دوره توانایی ساخت اپلیکیشن اندروید برای انواع وب سایت ها را داشته باشن</p>\r\n\r\n<p><!--more--></p>\r\n\r\n<div class="ck_div1">\r\n<p><span style="color:#FF0000">اهداف دوره آموزشی</span></p>\r\n\r\n<p>آموزش برنامه نویسی اندروید و تمام پیش نیاز های لازم برای برنامه نویسی اندروید</p>\r\n\r\n<p>آموزش ساخت اپلیکیشن اندروید برای فروشگاه اینترنتی</p>\r\n\r\n<p>آموزش انواع روش های پرداخت در اپلیکیشن اندروید</p>\r\n</div>\r\n\r\n<div class="ck_div1">\r\n<p><span style="color:#FF0000">محتوای دوره آموزشی</span></p>\r\n\r\n<p><span style="color:#0000FF">جلسه اول</span></p>\r\n\r\n<p>در این جلسه ضمن اشنایی با روش های مختلف برنامه نویسی اندرید به نصب و آماده سازی نرم افزار های لازم برای کد نوسی اندروید پرداخته می شود</p>\r\n\r\n<p>محتوای این قسمت در حال کامل شدن می باشد</p>\r\n</div>\r\n\r\n<div class="ck_div1">\r\n<p><span style="color:#FF0000">2 قسمت اول دوره جهت تست و ارزشیابی</span></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/films/android/webapp/1.zip">دانلود قسمت اول دوره</a></p>\r\n\r\n<p><a href="http://dl.idehpardazanjavan.com/films/android/webapp/2.zip">دانلود قسمت دوم دوره</a></p>\r\n</div>\r\n\r\n<div class="ck_div1">\r\n<p><span style="color:#FF0000">نکات قابل توجه</span></p>\r\n\r\n<p>1- این دوره در حال ضبط می باشد و تا الان 10 قسمت از دوره ضبط شده اشت</p>\r\n\r\n<p>2- هزینه پیش فروش این دوره 50 هزار تومان می باشد که بعد از اتمام دوره هزینه افزایش می یابد</p>\r\n\r\n<p>3- در هر مرحله از دوره کاربرانی که دوره را تهیه می نمایید لینک جلسات ضبط شده به کاربران ارایه می شود و مابقی لینک ها بعد از ضبط به ایمیل کاربر ارسال می گردد</p>\r\n</div>\r\n', '1468533119', '1468533161.jpg', '500000', 2, 'file/2.zip', '', '', 0, '', 0, 1),
(9, '  آموزش پروژه محور فریم ورک Laravel 5.2', '-آموزش-پروژه-محور-فریم-ورک-Laravel-5.2', '<p>به نام خدا</p>\r\n\r\n<p>با عرض سلام و ادب خدمت کاربران <span style="color:#FF0000">سایت ایده پردازان جوان</span></p>\r\n\r\n<p>برای ساخت پروژه های حرفه ای و قدرتمند با زبان برنامه نویسی php استفاده از فریم ورک های این زبان اجتناب ناپذیر هست. در واقع برای ساخت یک پروژه به صورت استاندار و با امنیت بالا نیاز هست از فریم ورک های قدرتمندی مثل زند -لاراول-یی و.. استفاده شود</p>\r\n', '1468969363', '1468969363.jpg', '500000', 8, '', '2 گیگابایت', '15 ساعت', 50, '', 2, 1);

-- --------------------------------------------------------

--
-- Table structure for table `sessions`
--

CREATE TABLE IF NOT EXISTS `sessions` (
  `id` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `ip_address` varchar(45) COLLATE utf8_unicode_ci DEFAULT NULL,
  `user_agent` text COLLATE utf8_unicode_ci,
  `payload` text COLLATE utf8_unicode_ci NOT NULL,
  `last_activity` int(11) NOT NULL,
  UNIQUE KEY `sessions_id_unique` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('7c33b781d4f93d471fd73831120ea348b09ef989', 3, '::1', 'Mozilla/5.0 (Windows NT 6.3; rv:47.0) Gecko/20100101 Firefox/47.0', 'YTo2OntzOjY6Il90b2tlbiI7czo0MDoiSG5xRTdVZzJsSDRGaWZEeHZIN0xoU3pzZm1lclgwaklmNzRCMzJENSI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MzY6Imh0dHA6Ly9sb2NhbGhvc3Qvc2hvcC9hZG1pbi9vcmRlci8xMyI7fXM6NToiZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo3OiJDYXB0Y2hhIjtzOjU6Ik9LQzJJIjtzOjUwOiJsb2dpbl93ZWJfNTliYTM2YWRkYzJiMmY5NDAxNTgwZjAxNGM3ZjU4ZWE0ZTMwOTg5ZCI7aTozO3M6OToiX3NmMl9tZXRhIjthOjM6e3M6MToidSI7aToxNDY5MDU4NTIwO3M6MToiYyI7aToxNDY5MDU3MDk4O3M6MToibCI7czoxOiIwIjt9fQ==', 1469058520);

-- --------------------------------------------------------

--
-- Table structure for table `setting`
--

CREATE TABLE IF NOT EXISTS `setting` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `option_name` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `option_value` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=5 ;

--
-- Dumping data for table `setting`
--

INSERT INTO `setting` (`id`, `option_name`, `option_value`) VALUES
(1, 'TerminalId', ''),
(2, 'UserName', ''),
(3, 'Password', ''),
(4, 'Discounts', 'Active');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `fname` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `role` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `username` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `users_email_unique` (`email`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=5 ;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
